---
type: ParameterElement
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ParameterElement

`Autodesk.Revit.DB.ParameterElement` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDefinition | 2016 | `public InternalDefinition GetDefinition ()` |
| Property | Parameter | — | `` |